"""
Создайте несколько переменных разных типов.
Проверьте к какому типу относятся созданные переменные.
"""
a = 5
b = 'a'
c = 2.0
d = []
e = {}
print(type(a), type(b), type(c), type(d), type(e))
